package com.example.hai_da_shi_tang2019;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.widget.ArrayAdapter;
import android.widget.ListView;

public class gang_shi_shao_ya extends AppCompatActivity {
private String[]data={"由于炒一般都是旺火速成，在很大程度上保持了原料的营养成分。炒是中国传统烹调方法，烹制食物时，锅内放少量的油在旺火上快速烹制，搅拌、翻锅。炒的过程中，食物总处于运动状态。将食物扒散在锅边，再收到锅中，再扒散不断重复操作。这种烹调法可使肉汁多、味美，可使蔬菜嫩又脆。当然炒的方法是多种多样的，但基本操作方法是先将炒锅或平锅烧热（这时的锅热得滴上一滴水都会发出唧唧声）注入油烧热。先炒肉，待熟盛出。再炒蔬菜、再将炒好的肉倒入锅，兑入汁和调料，待汁收好。出锅装盘上台。因炒菜是开饭前才进行制作的，所以每餐不要准备两个以上的炒菜。\n" +
        "炒法分类编辑\n" +
        "1、生炒\n" +
        "生炒又称火边炒，以不挂糊的原料为主。先将主料放入沸油锅中，炒至五、六成熟，再放入配料，配料易熟的可迟放，不易熟的与主料一齐放入，然后加入调味，迅速颠翻几下，断生即好。这种炒法，汤汁很少，清爽脆嫩。如果原料的块形较大，可在烹制时兑人少量汤汁，翻炒几下，使原料炒透，即行出锅。放汤汁时，需在原料的本身水分炒干后再放，才能入味。\n" +
        "2、熟炒\n" +
        "熟炒一般先将大块的原料加工成半熟或全熟（煮、烧、蒸或炸熟等），然后改刀成片、块等，放入沸油锅内略炒，再依次加入辅料、调味品和少许汤汁，翻炒几下即成。熟炒的原料大都不挂糊，起锅时一般用湿团粉勾成薄芡，也有用豆瓣酱、甜面酱等调料烹制而不再勾芡的。熟炒菜的特点是略带卤汁、酥脆入味。\n" +
        "3、软炒（又称滑炒）\n" +
        "先将主料出骨，经调味品拌脆，再用蛋清团粉上浆，放入五、六成热的温油锅中，边炒边使油温增加，炒到油约九成热时出锅，再炒配料，待配料快熟时，投入主料同炒几下，加些卤汁，勾薄芡起锅。软炒菜肴非常嫩滑，但应注意在主料下锅后，必须使主料散开，以防止主料挂糊粘连成块。\n" +
        "4、煸炒（又称干煸）\n" +
        "干炒是将不挂糊的小型原料，经调味品拌腌后，放入八成热的油锅中迅速翻炒，炒到外面焦黄时，再加配料及调味品（大多包括带有辣味的豆瓣酱、花椒粉、胡椒粉等）同炒几下，待全部卤汁被主料吸收后，即可出锅。于炒菜肴的一般特点是干香、酥脆、略带麻辣。\n" +
        "5、焦炒\n" +
        "将加工的小型原料腌渍过的油根据菜肴的不同要求，或直接炸或拍粉炸或挂糊炸再经用请汁或芡汁调味而成菜的技法。工艺流程：选料→切配→喂味→拍粉或挂糊→炸制→炒制调味→装盘焦炒分挂糊和不挂糊，但都必须炸焦炸透，调料即用清汁也可用芡汁，但让原料充分吸收，保持菜肴味浓韧脆，焦香。口味咸鲜采用卧汁方法，不用糖、醋而焦熘加糖醋，代表菜焦炒海鳗丝。\n" +
        "6、软炒（也称水炒）\n" +
        "将液体原料如牛奶掺入调料，辅料拌匀，或将加工成蓉泥的原料加汤水调匀，用中小火少量温油加热炒制而凝结成菜的烹调方法。或将鸡蛋调散成为液体状态加入调料和辅料拌匀不用油而用汤水炒制凝结成菜的烹调方法，也称水炒。工艺流程：选料→切配→挂糊→炸制→调味→装盘原料经过挂糊油炸表层变脆，原料在炒制中又吸附了芡汁的滋味，形成了外焦里嫩滋味浓郁的特色。口味小甜小酸成鲜。代表菜：抓炒里脊，抓炒鱼片，抓炒虾仁。"};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_gang_shi_shao_ya);
        ArrayAdapter<String> adapter=new ArrayAdapter<String>(gang_shi_shao_ya.this,android.R.layout.simple_list_item_1,data);
        ListView listView=(ListView)findViewById(R.id.list_view);
        listView.setAdapter(adapter);    }
}
